import pandas as pd
from keras import models
from keras.layers import core
from matplotlib import pyplot as plt

if __name__ == '__main__':
    file_name = './temp/data1_GM11.xls'
    data = pd.read_excel(file_name)
    # 特征所在列
    feature = ['x1', 'x2', 'x3', 'x4', 'x5', 'x7']

    data_train = data.loc[1994: 2013].copy()
    # 数据标准化
    data_mean = data_train.mean()
    data_std = data_train.std()
    data_train = (data_train - data_mean) / data_std
    # 取出数据作为训练数据
    X_train = data_train[feature]
    # 取出y值
    y_train = data_train['y']

    # 建立模型
    model = models.Sequential()
    # 添加输入层（6个点）到 隐藏层（12个点）的连接
    model.add(core.Dense(input_dim=6, units=12))
    # 隐藏层使用relu激活函数
    model.add(core.Activation('relu'))
    # 添加隐藏层（12个点）到输出层（1个点）的连接
    model.add(core.Dense(input_dim=12, units=1))
    model.compile(optimizer='adam', loss='mean_squared_error', metrics=['accuracy'])
    # 训练模型
    model.fit(X_train, y_train, epochs=10000, batch_size=32, verbose=1)
    # 保存模型参数
    model.save_weights('./temp/4-net.model')

    # 预测 并还原结果
    x = (data[feature] - data_mean[feature]) / data_std[feature]
    data['y_pred'] = model.predict(x) * data_std['y'] + data_mean['y']
    p = data[['y', 'y_pred']].plot(subplots=True, style=['b-o', 'r-*'])
    plt.savefig('{0}.png'.format('./img/Figure_04'))
    plt.show()
    print(data[feature + ['y', 'y_pred']])
    """
                  x1       x2       x3        x4        x5       x7        y       y_pred
    1994  3831732.00   181.54   448.19   7571.00   6212.70   525.71    64.87    67.186462
    1995  3913824.00   214.63   549.97   9038.16   7601.73   618.25    99.75    92.215149
    1996  3928907.00   239.56   686.44   9905.31   8092.82   638.94    88.11    92.712830
    1997  4282130.00   261.58   802.59  10444.60   8767.98   656.58   106.07   101.585083
    1998  4453911.00   283.14   904.57  11255.70   9422.33   758.83   137.32   135.794556
    1999  4548852.00   308.58  1000.69  12018.52   9751.44   878.26   188.14   186.967285
    2000  4962579.00   348.09  1121.13  13966.53  11349.47   923.67   219.91   224.765259
    2001  5029338.00   387.81  1248.29  14694.00  11467.35   978.21   271.91   267.283325
    2002  5070216.00   453.49  1370.68  13380.47  10671.78  1009.24   269.10   268.943848
    2003  5210706.00   533.55  1494.27  15002.59  11570.58  1175.17   300.55   299.811432
    2004  5407087.00   598.33  1677.77  16884.16  13120.83  1348.93   338.45   338.272156
    2005  5744550.00   665.32  1905.84  18287.24  14468.24  1519.16   408.86   408.959351
    2006  5994973.00   738.97  2199.14  19850.66  15444.93  1696.38   476.72   473.798889
    2007  6236312.00   877.07  2624.24  22469.22  18951.32  1863.34   838.99   840.858521
    2008  6529045.00  1005.37  3187.39  25316.72  20835.95  2105.54   843.14   842.429688
    2009  6791495.00  1118.03  3615.77  27609.59  22820.89  2659.85  1107.67  1102.258423
    2010  7110695.00  1304.48  4476.38  30658.49  25011.61  3263.57  1399.16  1414.036499
    2011  7431755.00  1700.87  5243.03  34438.08  28209.74  3412.21  1535.14  1507.983154
    2012  7512997.00  1969.51  5977.27  38053.52  30490.44  3758.39  1579.68  1605.621582
    2013  7599295.00  2110.78  6882.85  42049.14  33156.83  4454.55  2088.14  2074.951904
    2014  8142148.24  2239.29  7042.31  43611.84  35046.63  4600.40  2613.72  2097.397461
    2015  8460489.28  2581.14  8166.92  47792.22  38384.22  5214.78  3128.77  2510.446533

    """